[{"data":1,"prerenderedAt":76},["Reactive",2],{"content-query-KQgHXRlWlC":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"category":10,"status":11,"end":12,"draft":13,"body":14,"_type":71,"_id":72,"_source":73,"_file":74,"_extension":75},"/posts/existence","posts",false,"","Dear Existence","knowledge is pain and ignorance is bliss","prose","finished","2023-04-16T00:00:00.000Z",true,{"type":15,"children":16,"toc":68},"root",[17,25,30,43,48,53,58,63],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":24},"text","Dear Existence,",{"type":18,"tag":19,"props":26,"children":27},{},[28],{"type":23,"value":29},"These past few weeks I've seen you peeking from around every corner.\nI see you in the cracks of the graffiti under the bridge, between pauses in my professor's lecture, lurking in the margins of books... why?\nWhy do you hide?\nI need to talk to you.",{"type":18,"tag":19,"props":31,"children":32},{},[33,35,41],{"type":23,"value":34},"Looking for you is like looking under the bed — I feel you stirring up trouble beneath me, then — ",{"type":18,"tag":36,"props":37,"children":38},"em",{},[39],{"type":23,"value":40},"poof!",{"type":23,"value":42},"\nYou're gone, and you leave me alone in this cruel, cold world that I don't understand.\nNone of us do.",{"type":18,"tag":19,"props":44,"children":45},{},[46],{"type":23,"value":47},"I'm very gullible, truly, so tell me anything and I will believe you.\nDoes the sun revolve around the moon? Do the secrets of people lie with the date they were born on?\nKeto diets, tech blogs, Albert Camus, those obscure Tumblr posts reposted a billion times that I and only a dozen people other relate to.\nTell me anything and I will believe you.",{"type":18,"tag":19,"props":49,"children":50},{},[51],{"type":23,"value":52},"Most days, I wake up, do my best imitation of an unhappily married penguin (they mate for life, you know, even if they've cuffed the wrong penguin), mope around for a bit, and then go to sleep.\nSeriously, tell me anything and I'll believe you.",{"type":18,"tag":19,"props":54,"children":55},{},[56],{"type":23,"value":57},"I'm tired of chasing your secret.\nWith every passing year, I renounce the old ideals in favor of a better truth.\nI used to believe people were good, then I learned that we are products of circumstance, and now I think I don't care anymore, that what I believe is inconsequential.\nThere was an uncountable amount of things that I was unaware of, and I'm disappointed to say that after much struggle, it is all still very uncountable.\nMy fixation, I learned, is like peeling back the layers of an onion: I'm cynical of the grandiose pursuit of fame, of self-delusional belief systems, of fabricated scarcity, but being a few layers deeper doesn't stop me from crying like everyone else.",{"type":18,"tag":19,"props":59,"children":60},{},[61],{"type":23,"value":62},"Enlighten me or give me the power of self-delusion.",{"type":18,"tag":19,"props":64,"children":65},{},[66],{"type":23,"value":67},"At least then I'll be free—",{"title":7,"searchDepth":69,"depth":69,"links":70},2,[],"markdown","content:posts:existence.md","content","posts/existence.md","md",1710041129775]