[{"title":"MSU, February 13th","body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"contents"},"children":[{"type":"text","value":"Contents"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#the-night-of"},"children":[{"type":"text","value":"the night of"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#the-morning-after"},"children":[{"type":"text","value":"the morning after"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#the-week-after"},"children":[{"type":"text","value":"the week after"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#invictus"},"children":[{"type":"text","value":"invictus"}]}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#change"},"children":[{"type":"text","value":"change"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For those that are not aware, and for future readers, the date is February 14th, and last night there was a shooting at my school, "},{"type":"element","tag":"a","props":{"href":"https://en.wikipedia.org/wiki/2023_Michigan_State_University_shooting","rel":["nofollow"]},"children":[{"type":"text","value":"Michigan State University"}]},{"type":"text","value":".\nThis blog will be updated in the coming days as new thoughts and observations arise."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As we recover from this tragedy, I want to remind everyone to be extra compassionate towards each other, and kind.\nWe all have different responses to trauma, and one way is not better or worse than anyone else's."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"MSU students:"}]},{"type":"text","value":" what follows is a description of my experiences during the shooting. If you would like to skip this section, click here — "},{"type":"element","tag":"a","props":{"href":"#the-morning-after"},"children":[{"type":"text","value":"the morning after"}]},{"type":"text","value":"."}]},{"type":"element","tag":"h1","props":{"id":"the-night-of"},"children":[{"type":"text","value":"the night of"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I was doing my PHY 440 - Electronics prelab when I saw texts from friends asking if I was okay and in a safe place.\nI replied yes, not knowing why they were concerned.\nThen I saw the alert texts.\n"},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Oh, there's a shooting somewhere close, it's probably no big deal."},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-1","ariaDescribedBy":["footnote-label"],"dataFootnoteRef":"","id":"user-content-fnref-1"},"children":[{"type":"text","value":"1"}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But the concerned texts kept pouring in and I realized that the shooting wasn't around campus, it was happening "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"on"}]},{"type":"text","value":" campus.\nThis was not \"a shooting has happened\". This was a shooting that was taking place, right now, and one that would continue for nearly 4 hours."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I replied to texts from friends saying they were hiding in the library, in the basement of the gym building, in their room holding their breathe frantically texting everyone they know.\nI got live updates relaying the suspected location of the shooter."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Familiar names of buildings that I recognized with ease, friends' dorms, classrooms, dining halls where I ate at only 2 hours before, ceased to represent buildings but instead encroaching dark clouds on my mental map of my school."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Why did I have to know this campus so well?"}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I always liked exploring the campus and prided myself on knowing all of the different resources at our disposal.\nDuring the first week of school, I had been to virtually every part of campus, ate at most of the dining halls, and had a pretty good idea where the good food spots, study spots, hiding-from-people spots were."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It was so much new information."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I went to so many different club things and activities, got turned around trying to remember where a building was, memorize bus routes, I even biked from my dorm to the student services building (a place very far away) and met the executive board of APASO"},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-2","ariaDescribedBy":["footnote-label"],"dataFootnoteRef":"","id":"user-content-fnref-2"},"children":[{"type":"text","value":"2"}]}]},{"type":"text","value":", stole their food, and later became an intern for them."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Those same people were holding an event in the basement of a residence hall, a 10 minute walk at best from where the shooting was first reported."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"what if the shooter was targetting asians? shit. i know what "},{"type":"element","tag":"a","props":{"href":"https://ocat.msu.edu/cores-cultural-rooms/","rel":["nofollow"]},"children":[{"type":"text","value":"room they're in"}]},{"type":"text","value":". glass windows and "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"zero"}]},{"type":"text","value":" shelter."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"i downloaded a police scanner app to get more updates. it wasn't hard to find the right channel — it was the most popular one, with over 130,000 listeners."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"i continued hearing names of familiar buildings called out over the radio: my friends' dorms, the dining hall i always ate dinner at.\nthis guy seemed to be everywhere. "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"there must be multiple shooters."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"handgun, rifle, hat, beanie, i heard stories of people banging on doors claiming to be fire or police.\nso many reports from so many different parts of campus, which made it impossible to say where he really was."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"it wasn't even clear if there were multiple shooters, since police were only looking for one, but a picture of three men walking down the side walk holding ARs was circulating on snap"},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-3","ariaDescribedBy":["footnote-label"],"dataFootnoteRef":"","id":"user-content-fnref-3"},"children":[{"type":"text","value":"3"}]}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"then i noticed that the buildings they were calling out was getting closer and closer to mine."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I remember never willfully checking the university-wide Snapchat story because there were always so many posts, most of them irrelevant.\nI only saw it on accident, and that was when I knew I was really bored."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I remember when an unfortunate incident at Akers, involving a drying machine, and a fire, left the whole laundry room unusable and ignited a war between the Akerites and the Holmies and the Hubbites or whatever."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I remember when fire trucks and ambulances arrived nightly on Akers' doorstep, how concern grew into concerned ridicule.\nHaving an emergency every night subverts the notion of what is an emergency.\nThe ambulance should just park outside for peak efficiency, we said."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"A picture of Akers Hall in the afternoon sun","src":"https://snworksceo.imgix.net/tsn/7319ea10-8214-4950-9bb8-f5a2cbb73c1d.sized-1000x1000.JPG?w=1000"},"children":[]}]},{"type":"element","tag":"img-caption","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A picture of Akers Hall. Photo by Riley Murdock."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I remember how I've somehow managed to avoid every single fire drill at Holmes hall so far, by always happening to be out, but happening to be in just when the shooting happened."}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"shit."}]},{"type":"text","value":" i barricaded my doors (i'd not already done so for some reason) and turned off my lights.\nin the dark, my laptop screen provided the only lighting as i tapped my pencil on the same prelab question that i've been on for the past half hour."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"what if they came up to my floor? what would i do?"}]},{"type":"text","value":" i grabbed the only bit of weaponary i owned — a tiny pair of scissors — considered if they were even sharp enough to puncture skin and, concluding that they weren't, set them down on my desk anyway just in case the shooter wanted to play rock-paper-scissors."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"element","tag":"em","props":{"className":["hl"]},"children":[{"type":"text","value":"*a gunshot*"}]},{"type":"text","value":": handgun, maybe revolver. about 300 yards away near the front of the building,"}]},{"type":"text","value":" i thought."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"i thought about unbarricading the door so he thinks no one is here, and then climbing up into the storage space about the closet or just into my lofted bed, where he can't see.\nbut then i decided against that, too, as i don't know how many rooms he's gotten into (probably not many, given the casualties at the time) and so would be inclined to search the first room he gets into carefully"},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-4","ariaDescribedBy":["footnote-label"],"dataFootnoteRef":"","id":"user-content-fnref-4"},"children":[{"type":"text","value":"4"}]}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On the radio, I heard one cop say, \"White, Ford something truck valid to a Jacob Jones, blahblah\" and the main dispatch lady said really quietly, \"That's one of our East Lansing officers.\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"They cleared buildings floor by floor, evacuating residents as they went, and the dozens of police cruisers left as swiftly as they'd came.\nI later saw the video of hoardes of people running out of Akers while an equal number of cops ran in, but the shooter wasn't there, at least not anymore."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For some reason, I decided to check Outlook only to find that both my math professor and my physics research mentor had reached out to ask if I was okay. One was titled \"r u ok?\", followed by \"Hi Ken, ...\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I couldn't help but start laughing. The juxtaposition of the \"r u ok?\" and \"Hi xxx,\" really got to me."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I later replied saying, \"Thanks for checking on me. I might not be able to get to our research project tonight.\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I see clearly now that humor is my coping mechanism, except I wouldn't even call it coping — it's just my default, and people resort to their defaults in times like those.\nIn almost no situation is it better to be stressed and panicked than calm and relaxed, and I know of no better way to stay relaxed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"At one point I decided that I wasn't going to make any progress on the prelab, so I closed my laptop and decided I'd try to go to sleep.\nI told a few people that were constantly checking up on me that I was going to sleep, and turned off the radio."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As my consciousness drifted away, the roar of the helicopter faded to a whimper.\nI vaguely remember seeing that the lockdown was lifted 12:18 AM, right before I fell asleep. He had shot himself when police approached and was pronounced dead."}]},{"type":"element","tag":"h1","props":{"id":"the-morning-after"},"children":[{"type":"text","value":"the morning after"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I woke up to this beautiful sunrise, maybe the most beautiful I've ever seen on this campus:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"A brilliant sunrise over Michigan State University","src":"/img/msu_sunrise.jpg"},"children":[]}]},{"type":"element","tag":"img-caption","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sunrise over MSU"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It wasn't raining, dark, or even cloudy. Had last night been a dream? I checked my messages — no — three students were dead, and more injured. It was all too surreal. My school was shot up, students died, and yet the sun trickled over treetops as per usual, that insensitive bastard."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I thought about the students who would not see this sunrise, the certain cancellation of classes and events, people going home for comfort and safety. I counted up the things that were broken overnight: families, friendships, security, and I imagined all the things that were yet to be broken: schedules, plans, normality, mental health, trust, motivation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The full ramification of last night's events were still beyond us.\nIn the coming weeks, there'll be vigils and protests, release of more information regarding the shooting.\nSome people will drop out of school, some you'll catch bursting into tears in the middle of the hallway.\nThere will be grief counseling, emails from administration, professors cancelling classes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our experience will be weaponized for political means, with or without our individual consent, and we'll hurt over and over as the world continues spinning in due course.\nWe'll deal with insensitive parents"},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-5","ariaDescribedBy":["footnote-label"],"dataFootnoteRef":"","id":"user-content-fnref-5"},"children":[{"type":"text","value":"5"}]}]},{"type":"text","value":" and friends who make light of us."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For months and years of our lives, and forever after, we will always think back to this day.\nTears rolled down my face as I realized that, in my life and in other peoples lives, there would now always be a before and an after.\nWhat we choose to do now, in this part of our lives which is more maleable than most, will shape how we look back on this time in the future."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"That is all for later. What I chose to do, in the moment, was read Emily Dickinson.\nIf you're on the MSU snap story, then you might have seen me post this.\nThis is Dickinson's \""},{"type":"element","tag":"a","props":{"href":"https://poets.org/poem/i-measure-every-grief-i-meet-561","rel":["nofollow"]},"children":[{"type":"text","value":"I Measure Every Grief I Meet"}]},{"type":"text","value":"\".\nI encourage everyone to read it. Dickinson knows everything."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our grief is not less than or greater than the griefs of other tragedies. It is not based on how far away you were from the gunshots. How safe you felt.\nIt is not ignorable, even if friends and family members ignore it or call you \"sensitive\" for not doing the same."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The rest of my day followed uneventfully, as I'm sure it did for most of us.\nI planned to play Catan with friends, but they already left campus, so we might revert to the old pandemic ways and hop on Discord.\nDoesn't that sound oddly comforting? To go back to the pandemic ways?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of the most consistently astonishing things about people is the resilience of the human character and the incredible kindness that we can generate for each other in times of need.\nWe have weathered the pandemic, and we will survive this one idiot's actions."}]},{"type":"element","tag":"h1","props":{"id":"wednesday-thursday"},"children":[{"type":"text","value":"wednesday & thursday"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"it's hard to believe that only a couple days had gone by. it feels like much longer."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"almost everyone who was able to go home had gone home, and those who stayed, stayed at their friends' places off-campus or in a nearby hotel which is offering free rooms to MSU students."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"many local businesses, including ones in nearby towns like novi and traverse city, are offering free or discounted services to msu students.\nmental health support is everywhere on campus, and i expect will probably remain active for the next couple of months."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"it is nice to see the kindness and support from the surrounding community, and to hear other people's stories.\nat times like these, it can be easy to feel disconnected to other peoples' perceptions of what is happening internally, but those who really care don't hold back on caring."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"wednesday was unbelievably windy. and thursday, earlier today, a peaceful snowfall covered the university with a decently-thick blanket of snow.\nwith everyone gone and not enough hot water running through the pipes, the sidewalk heating system did not melt off the snow like it usually does."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"when i walked home from my friend's dorm tonight, my boot's soft crunch on the new snow reminded me how happy i was, dancing down the sidewalk during a blizzard back in november, excited about the snow.\neven now, i felt an urge to be happy skidding around on the sidewalk, but the locked doors of a building i tried to pass through reminded me that we are still afraid, and i looked around to make sure no one was around."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"span","props":{"className":["hl"]},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"there is no one. i live in a ghost town now."}]}]}]},{"type":"element","tag":"h1","props":{"id":"the-week-after"},"children":[{"type":"text","value":"the week after"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"when you get knocked down, the hardest part isn't getting back up, it's trying to keep a straight gait afterwards."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"for me, the hardest part is separating a normal response from a trauma response. if i skip class, am i just being lazy? or do i necessarily lack some motivation as i subconsciously recover from the a traumatic event?\nam i just finding an socially acceptable excuse to be lazy?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"i struggle to regain the rhythm i worked so hard to build.\nmy already opaque memory trying to remember what things are happening when is a completely futile effort.\nassignments, names, basic facts are like orbeez on a water slide to me — they don't just \"slip\" through but rather it is a slim chance i'll spot one at all in their super fast descent."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"there's so much ADD that it is a statistical miracle that i can form coherent strands of thought at all."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I hear worries from friends and strangers alike that they might never recover from this.\nIf you are like me, you might notice that words of common objects slip between the folds of your brain.\nYou might stare blankly into space, start crying for no reason, or become hypervigilant about your surroundings.\nThat is all normal."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is a message from Natalia Khoshnam, offering some "},{"type":"element","tag":"a","props":{"href":"https://pastebin.com/2gi21EuJ","rel":["nofollow"]},"children":[{"type":"text","value":"wisdom and advice"}]},{"type":"text","value":" from their high school teacher at Columbine.\nIt put into words a lot of the thoughts I wasn't able to articulate clearly, so I hope it helps you as well."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We each heal on our own timescales, and it is not a race to see who can heal the fastest.\nPlus, even the people who seem most okay are prone to breaking down in tears at random intervals."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Be kind, especially to yourself."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Give yourself time.\nYou don't need to be okay a week from now.\nAs long as you are not wallowing, you will be okay."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you're unsure whether or not you should go to "},{"type":"element","tag":"a","props":{"href":"https://caps.msu.edu/emergency/feb2023crisisresponse/","rel":["nofollow"]},"children":[{"type":"text","value":"crisis counseling"}]},{"type":"text","value":", then chances are you would benefit from it.\nDon't be afraid to go!— people are here for you."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Feel free to reach out if you have something to add (my contact information is on the "},{"type":"element","tag":"a","props":{"href":"/"},"children":[{"type":"text","value":"welcome page"}]},{"type":"text","value":"), or want to talk about anything."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I hope that my post has at least been of some help to you. Take care, and read this poem."}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"h3","props":{"id":"invictus"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://poets.org/poem/invictus","rel":["nofollow"]},"children":[{"type":"text","value":"Invictus"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By William Ernest Henley:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Out of the night that covers me,"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nBlack as the Pit from pole to pole,"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nI thank whatever gods may be"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nFor my unconquerable soul."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the fell clutch of circumstance"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nI have not winced nor cried aloud."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nUnder the bludgeonings of chance"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nMy head is bloody, but unbowed."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Beyond this place of wrath and tears"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nLooms but the Horror of the shade,"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nAnd yet the menace of the years"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nFinds, and shall find, me unafraid."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It matters not how strait the gate,"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nHow charged with punishments the scroll,"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nI am the master of my fate:"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nI am the captain of my soul."}]}]},{"type":"element","tag":"h1","props":{"id":"change"},"children":[{"type":"text","value":"change"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of the most depressing thoughts that occurred to me since the shooting was that this might not make an impact to reduce further shootings."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"How long have school shootings been a problem now? Long enough to predate our collective memories, at least. The odds are low that MSU is among the last in that line."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So what do we do?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I can think of at least a few actionable things:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Email/call your congress representatives. I won't push for any particular political position here, but you can easily find guides and templates online for any stance."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Vote next time :) And carefully research your candidates beforehand."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Consider becoming an educator, policy-maker, first responder, doctor, nurse, etc, and if you are already in a service-oriented field, make it a goal to affect change when you are in power.\nIn a couple decades, the youth of today will be the ones in charge of the country. So it seems like, at least on the surface, that this nonsense will end eventually."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you are part of a project that I could help with, feel free to get in touch and I'd be glad to assist where I can."}]},{"type":"element","tag":"section","props":{"className":["footnotes"],"dataFootnotes":""},"children":[{"type":"element","tag":"h2","props":{"className":["sr-only"],"id":"footnote-label"},"children":[{"type":"text","value":"Footnotes"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{"id":"user-content-fn-1"},"children":[{"type":"text","value":"It's kind of fucked that I'm so insensitized to news about potential shootings, but every two weeks or so we get an alert that there is a potential shooter nearby, so we've learned to ignore them. "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-1","ariaLabel":"Back to reference 1","className":["data-footnote-backref"],"dataFootnoteBackref":""},"children":[{"type":"text","value":"↩"}]}]},{"type":"element","tag":"li","props":{"id":"user-content-fn-2"},"children":[{"type":"text","value":"Asian Pacific American Student Organization. And \"meeting\" them is a euphemism for accidentally barging into their retreat/planning meeting for the year. "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-2","ariaLabel":"Back to reference 2","className":["data-footnote-backref"],"dataFootnoteBackref":""},"children":[{"type":"text","value":"↩"}]}]},{"type":"element","tag":"li","props":{"id":"user-content-fn-3"},"children":[{"type":"text","value":"someone later said this was actually the national guard. but i'm not sure of this. "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-3","ariaLabel":"Back to reference 3","className":["data-footnote-backref"],"dataFootnoteBackref":""},"children":[{"type":"text","value":"↩"}]}]},{"type":"element","tag":"li","props":{"id":"user-content-fn-4"},"children":[{"type":"text","value":"we did find out, although this was later, that the guy was short, so maybe he wouldn't have seen me in my bed even if he jumped. "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-4","ariaLabel":"Back to reference 4","className":["data-footnote-backref"],"dataFootnoteBackref":""},"children":[{"type":"text","value":"↩"}]}]},{"type":"element","tag":"li","props":{"id":"user-content-fn-5"},"children":[{"type":"text","value":"I would know about insensitive parents. My mom called me during the shooting and started asking if I submitted my transfer applications. "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-5","ariaLabel":"Back to reference 5","className":["data-footnote-backref"],"dataFootnoteBackref":""},"children":[{"type":"text","value":"↩"}]}]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"contents","depth":3,"text":"Contents"},{"id":"invictus","depth":3,"text":"Invictus"},{"id":"footnote-label","depth":2,"text":"Footnotes"}]}}}]