[{"data":1,"prerenderedAt":64},["Reactive",2],{"content-query-NMvnr86RPO":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"category":10,"status":11,"start":12,"end":13,"body":14,"_type":59,"_id":60,"_source":61,"_file":62,"_extension":63},"/posts/jesus","posts",false,"","Dear Jesus","If you were here...","prose","finished","2022-11-01T00:00:00.000Z","2022-11-05T00:00:00.000Z",{"type":15,"children":16,"toc":56},"root",[17,25,30,35,48],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":24},"text","Dear Jesus,",{"type":18,"tag":19,"props":26,"children":27},{},[28],{"type":23,"value":29},"In my English class we're supposed to write to someone who's famous and dead.\nYou're certainly famous, but whether or not you're dead is a question that the rest of us have waged wars for eons upon, and is thus a topic I wish to avoid.\nMy justification for writing therefore lies in the fact that even if Jesus the God is not dead, Jesus the man is dead.\nSo I am writing exclusively to Jesus, the man.",{"type":18,"tag":19,"props":31,"children":32},{},[33],{"type":23,"value":34},"Dear Jesus, the man,",{"type":18,"tag":19,"props":36,"children":37},{},[38,40,46],{"type":23,"value":39},"The world would be a very different place if you were around.\nWhat do you think would happen?\nWould a video of you curing a blind person become a viral Tiktok turn into debate over whether the video is fake turn into breaking news, overtaking celebrity drama as the #1 trending news of the week turn into memes of thinly-veiled angst my generation sends to each other turn into conspiracy theories dissecting the Bible as an alien mind-control machine turn into a segment on Saturday night live turn into a banned topic at the dinner table turn into a campaign position for political factions turn into friends becoming strangers turn into families becoming strangers turn into a ludicrous business venture for the purported location where the video was taken turn into a scamming business for men with long hair turn into a desperate manhunt by every country's intelligence agency turn into an issue of national security turn into international alliances (to which the U.S. is intermittently committed to depending on the party of the presidency) turn into trade embargoes turn into an arms race turn into cold war turn into the elite forces of every nation - sorry, every ",{"type":18,"tag":41,"props":42,"children":43},"em",{},[44],{"type":23,"value":45},"developed",{"type":23,"value":47}," nation - camped outside a run-down hut in Afghanistan or somewhere on the west coast of Africa, and when you walk out there'd somehow be nuclear Armageddon.",{"type":18,"tag":19,"props":49,"children":50},{},[51],{"type":18,"tag":41,"props":52,"children":53},{},[54],{"type":23,"value":55},"—At least the people handing out Bibles to everyone will be happy",{"title":7,"searchDepth":57,"depth":57,"links":58},2,[],"markdown","content:posts:jesus.md","content","posts/jesus.md","md",1710041129857]